{
  "backend/main.mo": "Minimal Motoko canister actor with no methods defined.",
  "feature_evidence.json": "Feature evidence report describing two frontend requirements and the files they modify.",
  "frontend-file-summaries.txt": "Prewritten summaries of multiple frontend files for reference in build planning.",
  "frontend/index.css": "Tailwind base styles and custom color variables for light and dark themes with global element styling.",
  "frontend/index.html": "HTML entry point loading the React app and favicon with basic metadata.",
  "frontend/src/App.tsx": "Creates the TanStack router and renders it inside an error boundary with a fallback UI if router creation fails.",
  "frontend/src/cart/CartContext.tsx": "React context managing cart state with add, remove, update, clear, and quantity lookup helpers.",
  "frontend/src/cart/cartTypes.ts": "Type definitions for cart items and overall cart state.",
  "frontend/src/cart/cartUtils.ts": "Utility functions for price parsing, formatting, and cart subtotal and count calculations.",
  "frontend/src/components/cart/AddToCartToast.tsx": "Temporary toast component showing a brief animated 'added to cart' confirmation.",
  "frontend/src/components/order/WhatsAppCheckoutForm.tsx": "Checkout form validating customer info and sending structured WhatsApp order messages using cart contents.",
  "frontend/src/components/order/WhatsAppOrderForm.tsx": "Empty placeholder component file.",
  "frontend/src/components/sections/AboutSection.tsx": "About page section describing the restaurant’s story and features using cards and icons.",
  "frontend/src/components/sections/ContactSection.tsx": "Contact page section rendering address, phone, email, and hours from siteConfig using a responsive card grid.",
  "frontend/src/components/sections/HomeHeroSection.tsx": "Hero section with background image, intro text, menu and Zomato buttons, and social links.",
  "frontend/src/components/sections/MenuSection.tsx": "Renders categorized menu items with images, pricing, veg indicators, and add-to-cart functionality.",
  "frontend/src/components/sections/OrderSection.tsx": "Deprecated section returning null; kept for backward compatibility.",
  "frontend/src/components/site/SectionContainer.tsx": "Generic layout wrapper adding padding and container styling to a section.",
  "frontend/src/components/site/SiteFooter.tsx": "Footer with brand info, navigation links, contact details, social icons, and copyright.",
  "frontend/src/components/site/SiteHeader.tsx": "Responsive header with logo, navigation links, mobile menu, and cart button with badge.",
  "frontend/src/components/system/RenderErrorBoundary.tsx": "Error boundary component displaying a fallback UI and reload option on render failures.",
  "frontend/src/config/siteConfig.ts": "Static site configuration including branding, contact info, social links, and delivery settings.",
  "frontend/src/hooks/useActor.ts": "Creates and manages backend actor instances tied to Internet Identity, refreshing dependent queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and provider for Internet Identity authentication with login, logout, and identity persistence.",
  "frontend/src/hooks/useQueries.ts": "Empty placeholder file noting all data is static and requires no queries.",
  "frontend/src/index.css": "Sets up Tailwind layers and defines light/dark OKLCH color variables and base styles.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers and renders App.",
  "frontend/src/pages/AboutPage.tsx": "Renders the AboutSection component as the About page.",
  "frontend/src/pages/CheckoutPage.tsx": "Displays cart items, totals, and checkout options including WhatsApp and Zomato flows.",
  "frontend/src/pages/ContactPage.tsx": "Renders the ContactSection component as the Contact page.",
  "frontend/src/pages/HomePage.tsx": "Renders the HomeHeroSection as the home page content.",
  "frontend/src/pages/MenuPage.tsx": "Renders the MenuSection component as the Menu page.",
  "frontend/src/pages/SignupPage.tsx": "Provides a signup form with validation and submits data via WhatsApp link.",
  "frontend/src/routeTree.tsx": "Defines the root layout and all routes using TanStack Router.",
  "frontend/src/utils/menuImages.ts": "Maps menu item names to predetermined image assets based on keyword matching.",
  "frontend/src/utils/whatsapp.ts": "Generates WhatsApp order messages and links for cart checkout actions.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, typography, container queries, and animations.",
  "project_state.json": "Defines the project’s build state, required website features, architectural notes, and known issues for rebuilding a multi‑page Captain Pizza site with cart, checkout, WhatsApp/Zomato ordering, and updated contact details. Marks the current state as a fix request due to frontend load failures."
}